# FontName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..FontName Property
TextNode Class See Also
---
The name of the text font.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string FontName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FontName As String
	Get
```

Visual C++
---
```text
public:
property String^ FontName {
	String^ get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace